Repository: firadmuhammed827-ux/firas-ios
Catalog: ios/FirasAI/Features/Brain/Brain.xcstrings
Source language: en
Languages: ar

# brain.account
source: Account
ar: الحساب

# brain.addSources
source: Add sources
ar: إضافة مصادر

# brain.allSources
source: All sources
ar: كل المصادر

# brain.ask
source: Ask your sources
ar: اسأل مصادرَك

# brain.ask.button
source: Ask
ar: إرسال السؤال

# brain.ask.placeholder
source: Search or ask a precise question…
ar: ابحث أو اسأل سؤالاً دقيقاً…

# brain.cancel
source: Cancel
ar: إلغاء

# brain.close
source: Close
ar: إغلاق

# brain.counter.documents
source: Sources
ar: المصادر

# brain.counter.pages
source: Pages today
ar: صفحات اليوم

# brain.delete
source: Delete source
ar: حذف المصدر

# brain.dismissError
source: Dismiss error
ar: إخفاء الخطأ

# brain.hero
source: Your knowledge, organized and searchable
ar: معرفتك، مرتبة وقابلة للسؤال

# brain.hero.detail
source: Add your files and search them with answers tied to the original pages and passages.
ar: أضف ملفاتك وابحث داخلها بإجابات مرتبطة بالصفحات والمقاطع الأصلية.

# brain.importing
source: Reading and preparing source…
ar: يقرأ ويجهّز المصدر…

# brain.noResults
source: No matching passages yet.
ar: لا توجد نتائج مطابقة بعد.

# brain.noSources
source: Add your first source to make Brain ready for questions.
ar: أضف أول مصدر ليصبح Brain جاهزاً للأسئلة.

# brain.officeExport
source: DOCX, PPTX, and XLSX: export as PDF or text for reliable on-device reading.
ar: DOCX وPPTX وXLSX: صدّرها إلى PDF أو نص لقراءة موثوقة على iPhone.

# brain.openPassage
source: Open original passage
ar: فتح المقطع الأصلي

# brain.openSidebar
source: Open sidebar
ar: فتح القائمة

# brain.page
source: Page
ar: صفحة

# brain.results
source: Matching passages
ar: المقاطع المطابقة

# brain.searching
source: Searching sources and matching pages
ar: يبحث داخل المصادر ويطابق الصفحات

# brain.signIn
source: Sign in to open your library
ar: سجّل الدخول لفتح مكتبتك

# brain.sources
source: Source library
ar: مكتبة المصادر

# brain.supported
source: Native on-device reading
ar: قراءة أصلية على الجهاز

# brain.title
source: Firas Brain
ar: فِراس Brain
